Tekla.Structures.DrawingInternal.ICDelegate
CDelegate interface

Tekla.Structures.DrawingInternal.ICDelegate.ExportEnumerateObjects(Tekla.Structures.DrawingInternal.dotEnumerator_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportLineHandler(Tekla.Structures.DrawingInternal.dotGrLine_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportArcHandler(Tekla.Structures.DrawingInternal.dotGrArc_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPolylineHandler(Tekla.Structures.DrawingInternal.dotGrPolyline_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPolygonHandler(Tekla.Structures.DrawingInternal.dotGrPolygon_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCloudHandler(Tekla.Structures.DrawingInternal.dotGrCloud_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportRectangularCloudHandler(Tekla.Structures.DrawingInternal.dotGrRectangularCloud_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportRectangleHandler(Tekla.Structures.DrawingInternal.dotGrRectangle_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportHatchLineHandler(Tekla.Structures.DrawingInternal.dotGrHatchLine_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCircleHandler(Tekla.Structures.DrawingInternal.dotGrCircle_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportOpenGraphicObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrOpenGraphicObjectAttributes_t@,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportClosedGraphicObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrClosedGraphicObjectAttributes_t@,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportHatchLineAttributesHandler(Tekla.Structures.DrawingInternal.dotGrHatchLineAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPointListHandler(Tekla.Structures.DrawingInternal.dotGrPointList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetColorIndexFromARGB(Tekla.Structures.DrawingInternal.dotARGBColor_t@)
Inserts the specified ARGB color into the global color map and returns its index.
ARGB: Color structure defining alpha, red, green, blue values.
Returns: The TS globally unique color index.

Tekla.Structures.DrawingInternal.ICDelegate.ExportGetARGBFromColorIndex(System.Int32,Tekla.Structures.DrawingInternal.dotARGBColor_t@)
ColorIndex: TS globally unique color index.
ARGB: Color structure defining alpha, red, green, blue values (output).
Returns: true.

Tekla.Structures.DrawingInternal.ICDelegate.ExportIsStandardColor(System.Int32)
ColorIndex: TS globally unique color index.
Returns: Non-zero value if the input color is a standard TS color. Zero if it is a user defined color

Tekla.Structures.DrawingInternal.ICDelegate.ExportGetColorIndexFromSaveFormat(System.String)
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: TS globally unique color index.

Tekla.Structures.DrawingInternal.ICDelegate.ExportGetSaveFormatFromColorIndex(System.Int32,System.String@)
ColorIndex: TS globally unique color index.
SaveFormat: Color save format (hex ie 0xFF140413 or TS standard color index).
Returns: true.

Tekla.Structures.DrawingInternal.ICDelegate.ImportPointListHandler(Tekla.Structures.DrawingInternal.dotGrPointList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportIntListHandler(Tekla.Structures.DrawingInternal.dotGrIntList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ImportIntListHandler(Tekla.Structures.DrawingInternal.dotGrIntList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDoubleListHandler(Tekla.Structures.DrawingInternal.dotGrDoubleList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ImportDoubleListHandler(Tekla.Structures.DrawingInternal.dotGrDoubleList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportStringListHandler(Tekla.Structures.DrawingInternal.dotGrStringList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ImportStringListHandler(Tekla.Structures.DrawingInternal.dotGrStringList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportMarkElementListHandler(Tekla.Structures.DrawingInternal.dotGrElementList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ImportMarkElementListHandler(Tekla.Structures.DrawingInternal.dotGrElementList_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportViewHandler(Tekla.Structures.DrawingInternal.dotGrView_t@)


Tekla.Structures.DrawingInternal.ICDelegate.GetDrawingViewVisibilityFilterValue(System.Int32,System.String@)


Tekla.Structures.DrawingInternal.ICDelegate.GetRaiseReadWindowsNamesByViewIds(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPartHandler(Tekla.Structures.DrawingInternal.dotGrPart_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPartAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPartAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportBoltHandler(Tekla.Structures.DrawingInternal.dotGrBolt_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportBoltAttributesHandler(Tekla.Structures.DrawingInternal.dotGrBoltAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportEdgeChamferHandler(Tekla.Structures.DrawingInternal.dotGrEdgeChamfer_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportEdgeChamferAttributesHandler(Tekla.Structures.DrawingInternal.dotGrEdgeChamferAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPourHandler(Tekla.Structures.DrawingInternal.dotGrPour_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPourAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPourAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPourBreakHandler(Tekla.Structures.DrawingInternal.dotGrPourBreak_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPourBreakAttributesHandler(Tekla.Structures.DrawingInternal.dotGrPourBreakAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportConnectionHandler(Tekla.Structures.DrawingInternal.dotGrConnection_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSurfacingHandler(Tekla.Structures.DrawingInternal.dotGrSurfacing_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSurfacingAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSurfacingAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportWeldHandler(Tekla.Structures.DrawingInternal.dotGrWeld_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportWeldAttributesHandler(Tekla.Structures.DrawingInternal.dotGrWeldAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportWeldMarkHandler(Tekla.Structures.DrawingInternal.dotGrWeldMark_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportWeldMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrWeldMarkAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportTextHandler(Tekla.Structures.DrawingInternal.dotGrText_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportTextAttributesHandler(Tekla.Structures.DrawingInternal.dotGrTextAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportEmbeddedObjectHandler(Tekla.Structures.DrawingInternal.dotGrEmbeddedObject_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportEmbeddedObjectAttributesHandler(Tekla.Structures.DrawingInternal.dotGrEmbeddedObjectAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportReferenceModelHandler(Tekla.Structures.DrawingInternal.dotGrReferenceModel_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportReferenceModelAttributesHandler(Tekla.Structures.DrawingInternal.dotGrReferenceModelAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportTextFileHandler(Tekla.Structures.DrawingInternal.dotGrTextFile_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportTextFileAttributesHandler(Tekla.Structures.DrawingInternal.dotGrTextFileAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportLinkHandler(Tekla.Structures.DrawingInternal.dotGrLink_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportLinkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLinkAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGridHandler(Tekla.Structures.DrawingInternal.dotGrGrid_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGridAttributesHandler(Tekla.Structures.DrawingInternal.dotGrGridAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGridLineHandler(Tekla.Structures.DrawingInternal.dotGrGridLine_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGridLineAttributesHandler(Tekla.Structures.DrawingInternal.dotGrGridLineAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDrawingHandler(Tekla.Structures.DrawingInternal.dotGrDrawingAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDrawingHandlerHandler(Tekla.Structures.DrawingInternal.dotGrDrawingHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetIdsForDrawingsNeedingNumbering(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.ICDelegate.ExportLayoutHandler(Tekla.Structures.DrawingInternal.dotGrLayoutHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportMarkLearningHandler(Tekla.Structures.DrawingInternal.dotGrMarkLearningHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportMarkListingHandler(Tekla.Structures.DrawingInternal.dotGrMarkListingHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportOperationHandler(Tekla.Structures.DrawingInternal.dotGrOperationHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportAssociativityHandler(Tekla.Structures.DrawingInternal.dotGrAssociativityHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCloningHandler(Tekla.Structures.DrawingInternal.dotGrCloningHandler_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPrintDrawingHandler(Tekla.Structures.DrawingInternal.dotGrPrintDrawing_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportUserPropertyHandler(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportModelDatabaseUserPropertyHandler(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportStraightDimensionHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimension_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportStraightDimensionSetHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimensionSet_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportStraightDimensionSetExcludePartsAccordingToFilter(Tekla.Structures.DrawingInternal.dotGrDrawingObject_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportStraightDimensionSetAttributesHandler(Tekla.Structures.DrawingInternal.dotGrStraightDimensionSetAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportAngleDimensionAttributesHandler(Tekla.Structures.DrawingInternal.dotGrAngleDimensionAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportAngleDimensionHandler(Tekla.Structures.DrawingInternal.dotGrAngleDimension_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportRadiusDimensionAttributesHandler(Tekla.Structures.DrawingInternal.dotGrRadiusDimensionAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportRadiusDimensionHandler(Tekla.Structures.DrawingInternal.dotGrRadiusDimension_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCurvedDimensionRadialHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionRadial_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCurvedDimensionSetRadialHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetRadial_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCurvedDimensionSetRadialAttributesHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetRadialAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCurvedDimensionOrthogonalHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionOrthogonal_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCurvedDimensionSetOrthogonalHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetOrthogonal_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportCurvedDimensionSetOrthogonalAttributesHandler(Tekla.Structures.DrawingInternal.dotGrCurvedDimensionSetOrthogonalAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDimensionLinkHandler(Tekla.Structures.DrawingInternal.dotGrDimensionLink_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDrawingCheckerFetchCurrentDrawingErrors(System.Int32,System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportMarkHandler(Tekla.Structures.DrawingInternal.dotGrMarkBase_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSymbolHandler(Tekla.Structures.DrawingInternal.dotGrSymbol_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSymbolAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSymbolAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportLevelMarkHandler(Tekla.Structures.DrawingInternal.dotGrLevelMark_t@)
Function to handle .Net side requests about level marks
pLevelMark: .Net Level Mark
Returns: Result of request

Tekla.Structures.DrawingInternal.ICDelegate.ExportLevelMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t@)
Function to handle .Net side requests about level mark attributes
pLevelMarkAttributes: .Net Level Mark Attributes
Returns: Result of request

Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDotType(Tekla.Structures.DrawingInternal.dotGrDrawingObject_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPickerHandler(Tekla.Structures.DrawingInternal.dotDrawingUIPickerWrapper_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetSnapshotFromDatabase(Tekla.Structures.DrawingInternal.dotEnumerator_t@,System.Collections.Generic.List{System.Object}@,System.Boolean)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDrawingObjectSelectorHandler(Tekla.Structures.DrawingInternal.dotDrawingObjectSelector_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportViewAttributesHandler(Tekla.Structures.DrawingInternal.dotGrViewAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportAutomationHandler(Tekla.Structures.DrawingInternal.dotGrAutomation_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportLeaderLineHandler(Tekla.Structures.DrawingInternal.dotGrLeaderLine_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPluginHandler(Tekla.Structures.DrawingInternal.dotGrPlugin_t@,System.String@,System.Boolean)


Tekla.Structures.DrawingInternal.ICDelegate.ExportReinforcementHandler(Tekla.Structures.DrawingInternal.dotGrReinforcementBase_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportReinforcementSetGroupGetModelIdentifiers(Tekla.Structures.DrawingInternal.dotGrReinforcementSetGroupIdentifiers_t@,System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportReinforcementBaseAttributesHandler(Tekla.Structures.DrawingInternal.dotGrReinforcementBaseAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportAssociativityRuleHandler(Tekla.Structures.DrawingInternal.dotGrAssociativity_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDetailMarkHandler(Tekla.Structures.DrawingInternal.dotGrDetailMark_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDetailMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrDetailMarkAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSectionMarkHandler(Tekla.Structures.DrawingInternal.dotGrSectionMark_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSectionMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrSectionMarkAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportViewCommandHandler(Tekla.Structures.DrawingInternal.dotGrViewCommand_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPluginQueueHandler(Tekla.Structures.DrawingInternal.dotGrPluginQueue_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportPickerCommandHandler(Tekla.Structures.DrawingInternal.dotGrPickerCommand_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportEnumerateCustomLineTypes(Tekla.Structures.DrawingInternal.dotGrCustomLineTypes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetChangedDrawingForUpdatedEvent(Tekla.Structures.DrawingInternal.dotGrDrawingAttributes_t@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSetDrawingPlotDateById(System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetNextModelObjectIdentifier(System.Int32@,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplayRevisionDialog


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplayDrawingPropertiesDialog


Tekla.Structures.DrawingInternal.ICDelegate.ExportArePoursShownInDrawing


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplayDrawingUdaDialog


Tekla.Structures.DrawingInternal.ICDelegate.ExportUpdateSelectedDrawings


Tekla.Structures.DrawingInternal.ICDelegate.ExportNumberDrawings


Tekla.Structures.DrawingInternal.ICDelegate.ExportUpdateSelectedDrawingMarks


Tekla.Structures.DrawingInternal.ICDelegate.ExportRecreateSelectedDrawings


Tekla.Structures.DrawingInternal.ICDelegate.ExportDeleteSelectedDrawings


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplayDrawingCloningDialog


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplaySnapshotsDialog


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplaySnapshotDialogByFileName(System.String)


Tekla.Structures.DrawingInternal.ICDelegate.ExportDisplaySnapshotsDialogByGuid(System.String)


Tekla.Structures.DrawingInternal.ICDelegate.ExportAddToMasterDrawingCatalog


Tekla.Structures.DrawingInternal.ICDelegate.ExportCopySelectedDrawingsToNewSheet


Tekla.Structures.DrawingInternal.ICDelegate.ExportHighlightGridLine(System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportUnhighlightGridLine(System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportHighlightPartInView(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportUnhighlightPartInView(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportHighlightCutInView(System.Int32,System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportUnhighlightCutInView(System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportShowAssociativityPinPushed(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportShowAssociativityPinUnpushed(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportFilterDrawingListByParts


Tekla.Structures.DrawingInternal.ICDelegate.ExportSignalDrawingSelectionChanged


Tekla.Structures.DrawingInternal.ICDelegate.ExportSignalDocumentManagerClosed


Tekla.Structures.DrawingInternal.ICDelegate.ExportSetDocumentManagerController(Tekla.Structures.DrawingInternal.IDocumentManagerController)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDocumentManagerController(Tekla.Structures.DrawingInternal.IDocumentManagerController@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportTryOpenDrawing(System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetNumberOfNonUpToDateObjectsAndPours


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetEditMode


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDrawingExportFileName(System.Int32,System.String,System.String,System.Boolean,System.Boolean,System.Boolean,System.String@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDrawingExportFileNameExt(System.Int32,System.String,System.String,System.Int32,System.Boolean,System.Boolean,System.String@)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSelectPartsByDrawings


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDrawingsBySelectedParts(Tekla.Structures.DrawingInternal.dotClientId_t,System.Boolean,System.Boolean)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSetColorRgb(System.Int32,System.Byte,System.Byte,System.Byte)


Tekla.Structures.DrawingInternal.ICDelegate.ExportSetPenWidth(System.Int32,System.Int32)


Tekla.Structures.DrawingInternal.ICDelegate.ExportRefreshColorMode


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDrawingReadyForIssuingChangeEvent(System.String@)


Tekla.Structures.DrawingInternal.ICDelegate.LoadAttributeFileNameToDialogAndApply(System.String,System.String)


Tekla.Structures.DrawingInternal.ICDelegate.LoadAttributeFileNameToDialogAndModify(System.String,System.String)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetAllColorPaletteFiles(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetDrawingToObjectMapping(Tekla.Structures.DrawingInternal.dotClientId_t)


Tekla.Structures.DrawingInternal.ICDelegate.ExportShowColorPalette(System.Int32,System.IntPtr)


Tekla.Structures.DrawingInternal.ICDelegate.ExportShowColorPaletteForHatchBackground(System.Int32,System.IntPtr)


Tekla.Structures.DrawingInternal.ICDelegate.ExportGetPluginInputById(System.Int32,Tekla.Structures.DrawingInternal.dotPluginInput_t@)


Tekla.Structures.DrawingInternal.ICDelegate.GetDrawingRuntimeIdFromFilename(System.String)
